from datetime import datetime

whole_hour = {0: "полноч", 1: "час ночи", 2: "два часа", 3: "три часа", 4: "четыре часа", 5: "пять часов",
              6: "шесть часов", 7: "семь часов",
              8: "восемь часов", 9: "девять часов", 10: "десять часов", 11: "одинадцать часов", 12: "двенадцать часов",
              13: "час дня",
              14: "два часа", 15: "три часа", 16: "четыре часа", 17: "пять часов", 18: "шесть часов", 19: "семь часов",
              20: "восемь часов",
              21: "девять часов", 22: "десять часов", 23: "одинадцать часов"}
next_hour = {0: "первого", 1: "второго", 2: "третьего", 3: "четвертого", 4: "пятого", 5: "шестого",
             6: "седьмого", 7: "восьмого", 8: "девятого", 9: "десятого", 10: "одинадцатого",
             11: "двенадцатого", 12: "первого",
             13: "второго", 14: "третьего", 15: "четвертого", 16: "пятого", 17: "шестого", 18: "седьмого",
             19: "восьмого", 20: "девятого", 21: "десятого", 22: "одинадцатого", 23: "двенадцатого"}
without_minutes_an_hour = {0: "час", 1: "два", 2: "три", 3: "четыре", 4: "пять", 5: "шесть",
                           6: "семь", 7: "восемь", 8: "девять", 9: "десять", 10: "одинадцать",
                           11: "двенадцать", 12: "час", 13: "два", 14: "три", 15: "четыре", 16: "пять",
                           17: "шесть", 18: "семь", 19: "восемь", 20: "девять", 21: "десять",
                           22: "одинадцать", 23: "полноч"}
so_many_minutes = {1: "одна минута", 2: "две минуты", 3: "три минуты", 4: "четыре минуты", 5: "пять минут",
                   6: "шесть минут",
                   7: "семь минут", 8: "восемь минут", 9: "девять минут", 10: "десять минут", 11: "одинадцать минут",
                   12: "двенадцать минут",
                   13: "тринадцать минут", 14: "четырнадцать минут", 15: "пятнадцать минут", 16: "шестнадцать минут",
                   17: "семнадцать минут", 18: "восемнадцать минут", 19: "девятнадцать минут", 20: "двадцать минт",
                   21: "двадцать одна минута", 22: "двадцать две минуты", 23: "двадцать три минуты",
                   24: "двадцать четыре минуты",
                   25: "двадцать пять минут", 26: "двадцать шесть минут", 27: "двадцать семь минут",
                   28: "двадцать восемь минут",
                   29: "двадцать девять минут", 31: "тридцать одна минута", 32: "тридцать две минуты",
                   33: "тридцать три минуты",
                   34: "тридцать четыре минуты", 35: "тридцать пять минут", 36: "тридцать шесть минут",
                   37: "тридцать семь минут",
                   38: "тридцать восемь минут", 39: "тридцать девять минут", 40: "сорок минут", 41: "сорок одна минута",
                   42: "сорок две минуты", 43: "сорок три минуты", 44: "сорок четыре минуты"}
without_minutes = {45: "пятнадцати минут", 46: "четырнадцати минут", 47: "тринадцати минут", 48: "двенадцати минут",
                   49: "одинадцати минут",
                   50: "десяти минут", 51: "девяти минут", 52: "девяти минут", 53: "семи минут", 54: "шести минут",
                   55: "пяти минут",
                   56: "четырех минут", 57: "трех минут", 58: "двух минут", 59: "одной минуты"}

a = input("Введите время в формате HH:MM : ").split(":")
h = int(a[0])
m = int(a[1])
if m == 0:
    print(whole_hour[h])
elif m == 30:
    print("половина", next_hour[h])
elif 1 <= m < 30 or 30 < m < 45:
    print(so_many_minutes[m], next_hour[h])
elif 45 <= m <= 59:
    print("Без", without_minutes[m], without_minutes_an_hour[h])

print("Текущее время:")
a = datetime.now().strftime('%H:%M').split(':')
h = int(a[0])
m = int(a[1])
if m == 0:
    print(whole_hour[h])
elif m == 30:
    print("половина", next_hour[h])
elif 1 <= m < 30 or 30 < m < 45:
    print(so_many_minutes[m], next_hour[h])
elif 45 <= m <= 59:
    print("Без", without_minutes[m], without_minutes_an_hour[h])
