# -*- coding: utf-8 -*-
from datetime import datetime
date_time_now = datetime.now()
date_time_now_str = (date_time_now.strftime("%H:%M"))
time_now = (date_time_now_str.split(":"))
h = int(time_now[0])
m = int(time_now[1])
d_h1 = {1:"второго", 2:"третьего", 3:"четвёртого", 4:"пятого", 5:"шестого", 6:"ceдьмого", 7:"восьмого", 8:"девятого", 9:"десятого", 10:"одиннадцатого", 11:"двенадцатого", 12:"первого", 13:"второго", 14:"третьего", 15:"четвёртого", 16:"пятого", 17:"шестого", 18:"седьмого", 19:"восьмого", 20:"девятого", 21:"десятого", 22:"одиннадцатого", 23:"двенадцатого", 00:"первого"}
d_h2 = {1:"час", 2:"два", 3:"три", 4:"четыре", 5:"пять", 6:"шесть", 7:"семь", 8:"восемь", 9:"девять", 10:"десять", 11:"одиннадцать", 12:"двенадцать", 13:"час", 14:"два", 15:"три", 16:"четыре", 17:"пять", 18:"шесть", 19:"семь", 20:"восемь", 21:"девять", 22:"десять", 23:"одиннадцать"}
d_m1 = {1:"одна", 2:"две", 3:"три", 4:"четыре", 5:"пять", 6:"шесть", 7:"семь", 8:"восемь", 9:"девять", 10:"десять", 11:"одиннадцать", 12:"двенадцать", 13:"тринадцать", 14:"четырнадцать", 15:"пятнадцать", 16:"шестнадцать", 17:"семнадцать", 18:"восемнадцать", 19:"девятнадцать", 20:"двадцать", 21:"двадцать одна", 22:"двадцать две", 23:"двадцать три", 24:"двадцать четыре", 25:"двадцать пять", 26:"двадцать шесть", 27:"двадцать семь", 28:"двадцать восемь", 29:"двадцать девять"}
d_m2 = {31:"тридцать одна", 32:"тридцать две", 33:"тридцать три", 34:"тридцать четыре", 35:"тридцать пять", 36:"тридцать шесть", 37:"тридцать семь", 38:"тридцать восемь", 39:"тридцать девять", 40:"сорок", 41:"сорок одна", 42:"сорок две", 43:"сорок три",44:"сорок четыре"}
d_m3 = {45:"пятнадцати", 46:"четырнадцати",47:"тринадцати", 48:"двенадцати", 49:"одиннадцати", 50:"десяти", 51:"девяти", 52:"восьми", 53:"семи", 54:"шести", 55:"пяти", 56:"четырех", 57:"трех", 58:"двух", 59:"одной"}
if m == 1 or m == 21:
    print(f'{d_m1.get(m)} минутa {d_h1.get(h)}')
if m == 31 or m == 41:
    print(f'{d_m2.get(m)} минутa {d_h1.get(h)}')   
elif m > 1  and m <=4:
    print(f'{d_m1.get(m)} минуты {d_h1.get(h)}')
elif m >= 5 and m <=29 and m !=21:
    print(f'{d_m1.get(m)} минут {d_h1.get(h)}')
elif m == 30:
    print(f'половина {d_h1.get(h)}')
    print(f'{d_m2.get(m)} минут {d_h1.get(h)}')
elif m >= 45:
    print(f'без {d_m3.get(m)} минут {d_h2.get(h+1)}')
elif m == 00 and h <=1 and h >= 4:
    print(f'{d_h2.get(h)} часа')
elif m == 00 and h <=5 and h >= 23:
    print(f'{d_h2.get(h)} часов')
elif m == 00 and h == 00:
    print("Полночь")
time_input = str(input("введите время в формаче чч:мм "))
time_input = time_input.split(":")
h = int(time_input[0])
m = int(time_input[1])
d_h1 = {1:"второго", 2:"третьего", 3:"четвёртого", 4:"пятого", 5:"шестого", 6:"ceдьмого", 7:"восьмого", 8:"девятого", 9:"десятого", 10:"одиннадцатого", 11:"двенадцатого", 12:"первого", 13:"второго", 14:"третьего", 15:"четвёртого", 16:"пятого", 17:"шестого", 18:"седьмого", 19:"восьмого", 20:"девятого", 21:"десятого", 22:"одиннадцатого", 23:"двенадцатого", 00:"первого"}
d_h2 = {1:"час", 2:"два", 3:"три", 4:"четыре", 5:"пять", 6:"шесть", 7:"семь", 8:"восемь", 9:"девять", 10:"десять", 11:"одиннадцать", 12:"двенадцать", 13:"час", 14:"два", 15:"три", 16:"четыре", 17:"пять", 18:"шесть", 19:"семь", 20:"восемь", 21:"девять", 22:"десять", 23:"одиннадцать"}
d_m1 = {1:"одна", 2:"две", 3:"три", 4:"четыре", 5:"пять", 6:"шесть", 7:"семь", 8:"восемь", 9:"девять", 10:"десять", 11:"одиннадцать", 12:"двенадцать", 13:"тринадцать", 14:"четырнадцать", 15:"пятнадцать", 16:"шестнадцать", 17:"семнадцать", 18:"восемнадцать", 19:"девятнадцать", 20:"двадцать", 21:"двадцать одна", 22:"двадцать две", 23:"двадцать три", 24:"двадцать четыре", 25:"двадцать пять", 26:"двадцать шесть", 27:"двадцать семь", 28:"двадцать восемь", 29:"двадцать девять"}
d_m2 = {31:"тридцать одна", 32:"тридцать две", 33:"тридцать три", 34:"тридцать четыре", 35:"тридцать пять", 36:"тридцать шесть", 37:"тридцать семь", 38:"тридцать восемь", 39:"тридцать девять", 40:"сорок", 41:"сорок одна", 42:"сорок две", 43:"сорок три",44:"сорок четыре"}
d_m3 = {45:"пятнадцати", 46:"четырнадцати",47:"тринадцати", 48:"двенадцати", 49:"одиннадцати", 50:"десяти", 51:"девяти", 52:"восьми", 53:"семи", 54:"шести", 55:"пяти", 56:"четырех", 57:"трех", 58:"двух", 59:"одной"}
if m == 1 or m == 21:
    print(f'{d_m1.get(m)} минутa {d_h1.get(h)}')
if m == 31 or m == 41:
    print(f'{d_m2.get(m)} минутa {d_h1.get(h)}')   
elif m > 1  and m <=4:
    print(f'{d_m1.get(m)} минуты {d_h1.get(h)}')
elif m >= 5 and m <=29 and m !=21:
    print(f'{d_m1.get(m)} минут {d_h1.get(h)}')
elif m == 30:
    print(f'половина {d_h1.get(h)}')
elif m > 30 and m < 45:
    print(f'{d_m2.get(m)} минут {d_h1.get(h)}')
elif m >= 45:
    print(f'без {d_m3.get(m)} минут {d_h2.get(h+1)}')
elif m == 00 and h <=1 and h >= 4:
    print(f'{d_h2.get(h)} часа')
elif m == 00 and h <=5 and h >= 23:
    print(f'{d_h2.get(h)} часов')
elif m == 00 and h == 00:
    print("Полночь")